# DataFrame Aggregation

### Concat 
d.f.資料框之間的串接可透過concat完成。  
根據Pandas官方API文件 https://pandas.pydata.org/docs/reference/api/pandas.concat.html?highlight=concat#pandas.concat  
`.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=True)`

引數功能介紹如下:
> objs : 需要被連接的物件，可為Series或DataFrame，需要用[...]包起來  
> axis : 運算指定軸  
> join : 選擇連結方式，功能類似SQL的outer/inner join  
> ignore_index : 是否要重新排列index，如果設定為False，則會把兩個物件的index疊起來  
> keys : 可用array-like物件設定multi Index  
> names : 設定index name  
> levels : 設定multi Index的levels  
> verify_integrity : 是否要顯示重複值  
> sort : 是否要排序資料  
> copy : 是否要複製原資料

In [2]:
import numpy as np
import pandas as pd

##### Series

In [3]:
# Series的連接
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [4]:
# 重新設定index
pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [5]:
# 設定multi Index
pd.concat([s1, s2], keys=['s1', 's2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [6]:
# 設定 index Name
pd.concat([s1, s2], keys=['s1', 's2'],
          names=['Series name', 'Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

##### DataFrame

In [7]:
# 
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [8]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [10]:
# 預設concat DataFrame
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [11]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [13]:
# 不具備的欄位值會以NaN替代
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [14]:
# inner JOIN
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [15]:
# outer JOIN
pd.concat([df1, df3], join="outer")

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [20]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [17]:
df1

  letter  number
0      a       1
1      b       2

In [22]:
# 指定軸運算
pd.concat([df1, df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [26]:
# 不顯示重複值，預設為False
df5 = pd.DataFrame([1], index=['a'])
df6 = pd.DataFrame([2], index=['a'])
pd.concat([df5, df6], verify_integrity=False)

   0
a  1
a  2

### Append
Numpy內可透過append()來擴增array，而Pandas同樣也能使用append()來串接Series與DataFrame  
須注意pd的append()不會變更原資料，而python原生的append() , extend()則會變更list  
這個方法會在後續的pd版本deprecated，所以串接使用concat或是後面的merge,join會比較好!

In [27]:
df1

  letter  number
0      a       1
1      b       2

In [28]:
df2

  letter  number
0      c       3
1      d       4

In [29]:
df1.append(df2)

C:\Users\proph\AppData\Local\Temp\ipykernel_27564\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

### Join
類似SQL的操作，pd內的merge()和join()提供高效能運算，讓使用者能方便地連接不同型態的資料。  
根據官方Pandas官方API文件 https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html?highlight=join#pandas.DataFrame.join  
join()可以針對DataFrame、Series與Index物件。  
`.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)`  

語法為 df1.join(df2)  
常用引數功能介紹如下:
> other : DataFrame, Series, or list of DataFrame  
> on : 輸入array-like物件或字串，類似Excel的VLOOKUP功能  
> how :預設值為left，可使用 {‘left’, ‘right’, ‘outer’, ‘inner’}，功能類似SQL join  
> lsuffix 與 rsuffix : 設定左右兩連接物件的串接欄位名稱，設定後串接欄位會在結果分開顯示  
> sort : 是否要依串接欄位做排序，預設為False

In [30]:
df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
df

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

In [31]:
other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                      'B': ['B0', 'B1', 'B2']})
other

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

In [32]:
# 設定左右串接欄位名稱
df.join(other, lsuffix='_caller', rsuffix='_other')

  key_caller   A key_other    B
0         K0  A0        K0   B0
1         K1  A1        K1   B1
2         K2  A2        K2   B2
3         K3  A3       NaN  NaN
4         K4  A4       NaN  NaN
5         K5  A5       NaN  NaN

In [34]:
other.set_index('key')

      B
key
K0   B0
K1   B1
K2   B2

In [44]:
# 使用右方資料的index做串接欄位，呼叫時給予index name
df.join(other.set_index('key'), on='key')

  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K2  A2   B2
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN

### Merge
根據Pandas官方API文件 https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html?highlight=merge#pandas.DataFrame.merge  
`.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)`  

語法為 pd.merge(df1 , df2)  
在merge()內有幾個關鍵字引數經常使用:  
> on : 明確指定串接欄位的名稱  
> left_on / right_on : 當左右資料串接欄位有共同資料內容但欄位名稱不同時使用  
> left_index / right_index : 同上，只是指定的是index   
> suffixes : 指定衝突欄顯示方式  
> how : 指定串接的方式，{‘left’, ‘right’, ‘outer’, ‘inner’, ‘cross’}，其實就是SQL內的join

##### 一對一join

In [45]:
df1 = pd.DataFrame({'employee':['Bob','Jake','Lisa','Sue'] , 'group':['AC','EG','EG','HR']})
df2 = pd.DataFrame({'employee':['Lisa','Bob','Jake','Sue'] , 'hire_date':[2004,2008,2012,2014]})
print(df1) ; print(df2)

  employee group
0      Bob    AC
1     Jake    EG
2     Lisa    EG
3      Sue    HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [47]:
df3 = pd.merge(df1,df2)
df3

  employee group  hire_date
0      Bob    AC       2008
1     Jake    EG       2012
2     Lisa    EG       2004
3      Sue    HR       2014

##### 多對一join

In [48]:
df4 = pd.DataFrame({'group':['AC','EG','HR'] , 'supervisor':['CA','GU','ST']})
df4

  group supervisor
0    AC         CA
1    EG         GU
2    HR         ST

In [50]:
# 和SQL相同，多對一的時候，會重複讀取既有資訊
# 可以看到 GU 在不同 row 重複讀取了兩次
pd.merge(df3 , df4)

  employee group  hire_date supervisor
0      Bob    AC       2008         CA
1     Jake    EG       2012         GU
2     Lisa    EG       2004         GU
3      Sue    HR       2014         ST

##### 多對多join

In [51]:
df5 = pd.DataFrame({'group':['AC','AC','EG','EG','HR','HR'] , 'skills':['math','sprd','code','linx','sprd','orgn']})
df5

  group skills
0    AC   math
1    AC   sprd
2    EG   code
3    EG   linx
4    HR   sprd
5    HR   orgn

In [53]:
# 和SQL相同，多對多的時候，會成對展開
# 可以看到每一個人名都根據group和skills的種類各數成對展開
pd.merge(df1, df5)

  employee group skills
0      Bob    AC   math
1      Bob    AC   sprd
2     Jake    EG   code
3     Jake    EG   linx
4     Lisa    EG   code
5     Lisa    EG   linx
6      Sue    HR   sprd
7      Sue    HR   orgn

In [54]:
# ON 關鍵字引數
pd.merge(df1,df2,on='employee')

  employee group  hire_date
0      Bob    AC       2008
1     Jake    EG       2012
2     Lisa    EG       2004
3      Sue    HR       2014

In [55]:
# LEFT_ON , RIGHT_ON 關鍵字引數
df3 = pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'] , 'salary':[7000,8000,12000,9000]})
df3

   name  salary
0   Bob    7000
1  Jake    8000
2  Lisa   12000
3   Sue    9000

In [57]:
pd.merge(df1 , df3 , left_on='employee' , right_on='name')

  employee group  name  salary
0      Bob    AC   Bob    7000
1     Jake    EG  Jake    8000
2     Lisa    EG  Lisa   12000
3      Sue    HR   Sue    9000

In [59]:
# LEFT_INDEX , RIGHT_INDEX 關鍵字引數
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a) ; print(df2a)

         group
employee
Bob         AC
Jake        EG
Lisa        EG
Sue         HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [60]:
pd.merge(df1a , df2a , left_index=True , right_index=True)

         group  hire_date
employee
Bob         AC       2008
Jake        EG       2012
Lisa        EG       2004
Sue         HR       2014

In [63]:
# 混合使用，但是要注意左右只能各選擇一種(on or index)
pd.merge(df1a , df3 , left_index=True , right_on='name')

  group  name  salary
0    AC   Bob    7000
1    EG  Jake    8000
2    EG  Lisa   12000
3    HR   Sue    9000

In [69]:
# how關鍵字引數
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
print(df1) ; print(df2)

     a  b
0  foo  1
1  bar  2
     a  c
0  foo  3
1  baz  4

In [70]:
# inner join
df1.merge(df2, how='inner', on='a')

     a  b  c
0  foo  1  3

In [71]:
# outer join
df1.merge(df2, how='outer', on='a')

     a    b    c
0  foo  1.0  3.0
1  bar  2.0  NaN
2  baz  NaN  4.0

In [73]:
# cross join
df1 = pd.DataFrame({'left': ['foo', 'bar']})
df2 = pd.DataFrame({'right': [7, 8]})
df1.merge(df2, how='cross')

   a_x  b  a_y  c
0  foo  1  foo  3
1  foo  1  baz  4
2  bar  2  foo  3
3  bar  2  baz  4

In [74]:
# suffixes關鍵字引數
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [75]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [76]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [77]:
# 兩個資料表都有rkey這個欄位，因此指定兩個同樣名稱的欄位分別是什麼名稱
df1.merge(df2, left_on='lkey', right_on='rkey',
          suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

### Groupby
如同SQL，在pd內也有groupby的功能，並且額外多了一個資料型別叫groupby。  
套用aggregation之前，呼叫groupby物件只會得到一個iterator。  
在這個物件下，可以套用許多聚合運算的方法:
1. aggregate()
2. filter()
3. transform()
4. apply()

In [11]:
# 
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                   'data':range(6) }, columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [20]:
# 未進行後續運算，回傳groupby物件
df.groupby('key')

In [26]:
# 加上aggregation運算後即可得結果
df.groupby('key').sum() , type(df.groupby('key').sum())

(     data
 key
 A       3
 B       5
 C       7,
 pandas.core.frame.DataFrame)

In [16]:
# groupby物件為iterable，因此有__iter__方法
for (x,y) in df.groupby('key'):
    print(x,y)

A   key  data
0   A     0
3   A     3
B   key  data
1   B     1
4   B     4
C   key  data
2   C     2
5   C     5

In [23]:
# 複合運算
df.groupby('key').sum()['data'].describe()

count    3.0
mean     5.0
std      2.0
min      3.0
25%      4.0
50%      5.0
75%      6.0
max      7.0
Name: data, dtype: float64

##### groupby + aggregate

In [30]:
rng = np.random.RandomState(10)
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                   'data1':range(6),
                   'data2':rng.randint(0,10,6)   
                  })
df

  key  data1  data2
0   A      0      9
1   B      1      4
2   C      2      0
3   A      3      1
4   B      4      9
5   C      5      0

In [29]:
# 注意輸入的聚合函數可以是字串、直接給函數名稱或者套用numpy內的函數
df.groupby('key').aggregate(['min', np.median , max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     1    5.0   9
B       1    2.5   4     4    6.5   9
C       2    3.5   5     0    0.0   0

##### groupby + filter

In [32]:
# 定義過濾函數
def filter_func(x):
    return x['data2'].std() > 4

In [33]:
df

  key  data1  data2
0   A      0      9
1   B      1      4
2   C      2      0
3   A      3      1
4   B      4      9
5   C      5      0

In [34]:
df.groupby('key').filter(filter_func)

  key  data1  data2
0   A      0      9
3   A      3      1

##### groupby + transform

In [35]:
df.groupby('key').transform(lambda x:x-x.mean())

   data1  data2
0   -1.5    4.0
1   -1.5   -2.5
2   -1.5    0.0
3    1.5   -4.0
4    1.5    2.5
5    1.5    0.0

##### groupby + apply

In [38]:
# 定義套用函數
def norm_by_data2(x):
    x['data1'] /= x['data2'].sum()
    return x

In [37]:
df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      9
1   B  0.076923      4
2   C       inf      0
3   A  0.300000      1
4   B  0.307692      9
5   C       inf      0

##### groupby + 指定分割物件
這類方法可以在groupby()內輸入array-like物件、dict、甚至是任意python函數

In [41]:
# 使用list做groupby
L=[0,1,0,1,2,0]
df

  key  data1  data2
0   A      0      9
1   B      1      4
2   C      2      0
3   A      3      1
4   B      4      9
5   C      5      0

In [43]:
[x for x in df.groupby(L)]

[(0,
    key  data1  data2
  0   A      0      9
  2   C      2      0
  5   C      5      0),
 (1,
    key  data1  data2
  1   B      1      4
  3   A      3      1),
 (2,
    key  data1  data2
  4   B      4      9)]

In [44]:
# 將資料由上而下依照指定標籤分組
df.groupby(L).sum()

   data1  data2
0      7      9
1      4      5
2      4      9

In [48]:
# 使用dict做groupby
mapping = {'A':'vowel' , 'B':'const' , 'C':'const'}
df2 = df.set_index('key')
df2

     data1  data2
key
A        0      9
B        1      4
C        2      0
A        3      1
B        4      9
C        5      0

In [50]:
df2.groupby(mapping).sum()

       data1  data2
key
const     12     13
vowel      3     10

In [51]:
# 使用任意函數做groupby
df2.groupby(str.lower).mean()

     data1  data2
key
a      1.5    5.0
b      2.5    6.5
c      3.5    0.0

In [58]:
# 特殊操作 (Multi Index)
df2.groupby([str.lower , mapping]).mean()

           data1  data2
key key
a   vowel    1.5    5.0
b   const    2.5    6.5
c   const    3.5    0.0

In [53]:
[x for x in df2.groupby([str.lower , mapping])]

[(('a', 'vowel'),
       data1  data2
  key
  A        0      9
  A        3      1),
 (('b', 'const'),
       data1  data2
  key
  B        1      4
  B        4      9),
 (('c', 'const'),
       data1  data2
  key
  C        2      0
  C        5      0)]

In [54]:
[str.lower , mapping]

[<method 'lower' of 'str' objects>, {'A': 'vowel', 'B': 'const', 'C': 'const'}]

### Pivot Table
pd內提供pivot_table()方法，讓使用者作樞紐運算!

In [62]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [63]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [67]:
# 使用pd的groupby
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [70]:
titanic.groupby(['sex','class'])[['survived']].aggregate('mean')

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [69]:
titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [75]:
# 使用pivot_table()快速解決! 
# 注意預設aggFunc為平均
titanic.pivot_table('survived' , index='sex' , columns='class' , aggfunc='mean')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [76]:
# 切分age欄位後，使用切分資料進行樞紐
age = pd.cut(titanic['age'] , [0,18,80])
age

0      (18.0, 80.0]
1      (18.0, 80.0]
2      (18.0, 80.0]
3      (18.0, 80.0]
4      (18.0, 80.0]
           ...
886    (18.0, 80.0]
887    (18.0, 80.0]
888             NaN
889    (18.0, 80.0]
890    (18.0, 80.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 80]]

In [78]:
titanic.pivot_table('survived' , ['sex' , age] , 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [79]:
# 使用fare欄位
fare = pd.qcut(titanic['fare'] , 2)
fare

0       (-0.001, 14.454]
1      (14.454, 512.329]
2       (-0.001, 14.454]
3      (14.454, 512.329]
4       (-0.001, 14.454]
             ...
886     (-0.001, 14.454]
887    (14.454, 512.329]
888    (14.454, 512.329]
889    (14.454, 512.329]
890     (-0.001, 14.454]
Name: fare, Length: 891, dtype: category
Categories (2, interval[float64, right]): [(-0.001, 14.454] < (14.454, 512.329]]

In [90]:
# 同時在col與row都有自訂樞紐量!
titanic.pivot_table('survived' , 'sex' , [fare , 'class'])

fare   (-0.001, 14.454]                     (14.454, 512.329]            \
class             First    Second     Third             First    Second
sex
female              NaN  0.896552  0.580247          0.968085  0.936170
male                0.0  0.111111  0.119403          0.387931  0.222222

fare
class      Third
sex
female  0.396825
male    0.189873

In [92]:
# 使用margin引數算各row/col小結
titanic.pivot_table('survived' , index='sex' , columns='class' , margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838